QuantumLeaps/3rd_party/nucleo-h533re/gnu/startup_stm32h533retx.c
// fault exception handlers --------------------------------------------------
__attribute__((naked)) void NMI_Handler(void);
void NMI_Handler(void) {
    // disable interrupts and reset SP in case of stack overflow
    __asm volatile ("  CPSID i\n  MOV   sp,%0" : : "r" (&__stack_end__));
    assert_failed("NMI", 1U);
}
//............................................................................
__attribute__((naked)) void HardFault_Handler(void);
void HardFault_Handler(void) {
    // disable interrupts and reset SP in case of stack overflow
    __asm volatile ("  CPSID i\n  MOV   sp,%0" : : "r" (&__stack_end__));
    assert_failed("HardFault", 1U);
}
//............................................................................
__attribute__((naked)) void MemManage_Handler(void);
void MemManage_Handler(void) {
    // disable interrupts and reset SP in case of stack overflow
    __asm volatile ("  CPSID i\n  MOV   sp,%0" : : "r" (&__stack_end__));
    assert_failed("MemManage", 1U);
}
//............................................................................
__attribute__((naked)) void BusFault_Handler(void);
void BusFault_Handler(void) {
    // disable interrupts and reset SP in case of stack overflow
    __asm volatile ("  CPSID i\n  MOV   sp,%0" : : "r" (&__stack_end__));
    assert_failed("BusFault", 1U);
}
//............................................................................
__attribute__((naked)) void UsageFault_Handler(void);
void UsageFault_Handler(void) {
    // disable interrupts and reset SP in case of stack overflow
    __asm volatile ("  CPSID i\n  MOV   sp,%0" : : "r" (&__stack_end__));
    assert_failed("UsageFault", 1U);
}
//............................................................................
__attribute__((naked)) void SecureFaultHandler(void);
void SecureFaultHandler(void) {
    // disable interrupts and reset SP in case of stack overflow
    __asm volatile ("  CPSID i\n  MOV   sp,%0" : : "r" (&__stack_end__));
    assert_failed("SecureFault", 1U);
}
//............................................................................
__attribute__((naked)) void Default_Handler(void);
void Default_Handler(void) {
    // disable interrupts and reset SP in case of stack overflow
    __asm volatile ("  CPSID i\n  MOV   sp,%0" : : "r" (&__stack_end__));
    assert_failed("Default", 1U);
}
